In [37]:
import pandas as pd
import numpy as np
import pickle
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import accuracy_score

dataset =pd.read_csv('dataset.csv')
dataset.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

<div align="center"><h2> Data cleaning</h2></div>

In [38]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [39]:
dataset.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [40]:
#Total score = math score + reading score + writing score
dataset['Total Score']=dataset['math score']+dataset['reading score']+dataset['writing score']

In [41]:
#Function for getting a passing grade
def result(TS,MS,WS,RS ):
    if(TS>=150 and MS>=50 and WS>=50 and RS>=50):
        return 1
    else:
        return 0
#Generating Pass / Fail based on scores
dataset['Pass/Fail']=dataset.apply(lambda x: result(x['Total Score'],x['math score'],x['writing score'],x['reading score']),axis = 1)

In [42]:
# Select x columns
x=dataset[['math score','reading score','writing score']]
# Select y column
y= dataset[['Total Score','Pass/Fail']]
x

     math score  reading score  writing score
0            72             72             74
1            69             90             88
2            90             95             93
3            47             57             44
4            76             78             75
..          ...            ...            ...
995          88             99             95
996          62             55             55
997          59             71             65
998          68             78             77
999          77             86             86

[1000 rows x 3 columns]

<div align="center"><h2> Data Training</h2></div>

In [43]:
# Divide data into training and validation subsets
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.2)
y

     Total Score  Pass/Fail
0            218          1
1            247          1
2            278          1
3            148          0
4            229          1
..           ...        ...
995          282          1
996          172          1
997          195          1
998          223          1
999          249          1

[1000 rows x 2 columns]

In [50]:
model = LinearRegression()
model.fit(x_train,y_train)

LinearRegression()

In [51]:
#prediction
result=model.predict(x_test)

In [36]:
input_data = (100, 70, 100)
input_data = np.asarray(input_data)
input_data = input_data.reshape(1, -1)

test=model.predict(input_data)
test[0]

C:\Users\BENAIAH\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([270.        ,   1.43190608])

<div align="center"><h2> Saving Model</h2></div>

In [35]:
#Save model in file
pickle.dump(model,open('model.plk','wb'))